package program.cprogram;

import users.Users;

public class CProgram {

    public static void main(String[] args) {
        System.out.println("CProgram 실행");

        //대면 업무 전에 비대면 업무에 있어서, 서류신청에 준비물 등의 이야기. 전화상으로 업무가 완전히 끝나지는 않는다. 대면이 필요.
        // 구두 질의 응답. 대면 방문 예약 및 서류 안내만 가능. (지식 기반 인증, 단순 본인 추정)
        //이의 경우, 단순 상담, 분실 정지, 대면 예약 가능.
        // 5만원 이하의 상품권인 경우. 세금신고할 필요가 없어 개인정보 수집대상이 아니다. 
        // 5만원 이상인 경우, 소득세법(당첨금의 22% 제세공과금으로 신고 납부를 해야함)을 따라야하므로, 개인정보 수집이 필요. 대면이 필요.

        //*****************업무 진행 순서
        //회원(사용자)이 전화를 건다.
        Users user = new Users("John Doe", "사용자"); // user, 사용자
        //상담사는 걸려온 전화번호를 확인한다.

        //상담사가 전화를 받는다.



        //상담사는 자신의 이름을 밝히고, 사용자(회원)에게 어떤 일로 상담을 하는지 물어본다.
        //안녕하세요. ㅇㅇㅇ 상담사 첼시입니다. 무엇을 도와드릴까요?

        //사용자는 상담사에게 자신의 문의사항을 말한다.
        //안녕하세요. ㅇㅇ때문에 그런데요.

        //상담사는 사용자의 문의사항을 듣고, 상담 진행에 본인확인이 필요한지 판단하고, 상담을 진행한다.
        // 1. 본인확인이 필요한 경우 
        // 본인 확인이 필요한데요. 몇가지 여쭤보겠습니다. 
        // 성함이 어떻게 되시나요?
        // 본인 생년월일이 어떻게 되시나요?
        // 본인 주소가 어떻게 되시나요?

        // 2. 본인확인이 필요하지 않은 경우 - 궁금한 것에 대해 답변을 해주거나, 더 잘 알 수 있는 전화번호를 안내한다.

        // 상담사가 상담을 마치고, 상담 종료를 한다.
        // 이번 상담 일에 대해 기록을 남긴다.
    }
}